# Task 1 : Data Cleaning and Preprocessing

### Objective : Clean and prepare a raw dataset (with nulls, duplicates, inconsistent formats).

### Dataset (Mall Customer Segmentation Data)

### Steps of Cleaning and Preparing Data

**Step 1:** Import Necessary Libraries  
**Step 2:** Data Exploratory Analysis  
**Step 3:** Check Missing Values  
**Step 4:** Standardize Column Names  
**Step 5:** Clean Age Column  
**Step 6:** Clean Annual Income  
**Step 7:** Standardize Gender  
**Step 8:** Clean Membership Type  
**Step 9:** Clean Phone Number  
**Step 10:** Check for Duplicates  
**Step 11:** Validate Data Types  
**Step 12:** Final Quality Check  
**Step 13:** Save Cleaned Data

#  Step 1: Import Neccessary Library
We need to install a wide variety of libraries. For this we will install pandas, numpy and warnings libraries.

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

# Step 2: Data Exploratory Analysis
In the data discovery analysis, we will firstly recognize and analyze our data using a wide variety of functions in the pandas library.

In [2]:
# Load the CSV file
df = pd.read_csv(r"C:\Users\SHAHIL\Downloads\mall_customer_raw.csv")
df

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Membership Type,Email,Phone Number
0,1,Male,19.0,15.0,39,Gold,john.doe@email.com,555-0101
1,2,Male,21.0,15.0,81,Silver,mike.smith@email.com,555-0102
2,3,Female,20.0,16.0,6,Bronze,sarah.j@email.com,555-0103
3,4,Female,23.0,16.0,77,Gold,emma.w@email.com,NaN
4,5,Female,31.0,17.0,40,Silver,lisa.brown@email.com,555-0105
...,...,...,...,...,...,...,...,...
195,196,Male,38.0,137.0,88,Gold,todd.medina@email.com,555-0296
196,197,Female,46.0,NaN,32,Silver,christina.francis@email.com,555-0297
197,198,Male,35.0,140.0,93,Bronze,roy.arnold@email.com,555-0298
198,199,Female,32.0,140.0,14,NaN,laura.vargas@email.com,NaN
199,200,Male,53.0,137.0,89,Gold,wayne.chapman@email.com,555-0300

In [3]:
# Basic inspection
print(df.shape)

(200, 8)

In [4]:
print(df.head())

   CustomerID  Gender   Age  Annual Income (k$)   Spending Score (1-100)  \
0           1    Male  19.0                15.0                       39
1           2    Male  21.0                15.0                       81
2           3  Female  20.0                16.0                        6
3           4  Female  23.0                16.0                       77
4           5  Female  31.0                17.0                       40

  Membership Type                 Email Phone Number
0            Gold    john.doe@email.com     555-0101
1          Silver  mike.smith@email.com     555-0102
2          Bronze     sarah.j@email.com     555-0103
3            Gold      emma.w@email.com          NaN
4          Silver  lisa.brown@email.com     555-0105

In [5]:
df.head()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Membership Type,Email,Phone Number
0,1,Male,19.0,15.0,39,Gold,john.doe@email.com,555-0101
1,2,Male,21.0,15.0,81,Silver,mike.smith@email.com,555-0102
2,3,Female,20.0,16.0,6,Bronze,sarah.j@email.com,555-0103
3,4,Female,23.0,16.0,77,Gold,emma.w@email.com,NaN
4,5,Female,31.0,17.0,40,Silver,lisa.brown@email.com,555-0105

In [6]:
df[['Gender','Age']].head()

   Gender   Age
0    Male  19.0
1    Male  21.0
2  Female  20.0
3  Female  23.0
4  Female  31.0

In [7]:
df.tail()

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Membership Type,Email,Phone Number
195,196,Male,38.0,137.0,88,Gold,todd.medina@email.com,555-0296
196,197,Female,46.0,NaN,32,Silver,christina.francis@email.com,555-0297
197,198,Male,35.0,140.0,93,Bronze,roy.arnold@email.com,555-0298
198,199,Female,32.0,140.0,14,NaN,laura.vargas@email.com,NaN
199,200,Male,53.0,137.0,89,Gold,wayne.chapman@email.com,555-0300

In [8]:
df.sample(5)

,CustomerID,Gender,Age,Annual Income (k$),Spending Score (1-100),Membership Type,Email,Phone Number
80,81,Male,32.0,56.0,9,Silver,scott.cooper@email.com,555-0181
55,56,Female,49.0,41.0,80,NaN,rachel.carter@email.com,555-0156
130,131,Male,-67.0,82.0,12,Silver,willie.wallace@email.com,555-0231
133,134,Male,55.0,83.0,93,Silver,jesse.west@email.com,555-0234
184,185,Female,33.0,116.0,86,Bronze,bonnie.fields@email.com,555-0285

In [9]:
print(df.columns.tolist())

['CustomerID', 'Gender', 'Age', 'Annual Income (k$)', ' Spending Score (1-100)', 'Membership Type', 'Email', 'Phone Number']

# Step 3: Check Missing Values
Scan the dataset to identify columns with missing or null values.

In [10]:
# Check null values
print(df.isnull().sum())

# Check for NULL/NA strings
for col in df.columns:
    if df[col].dtype == 'object':
        null_strings = df[col].isin(['NULL', 'NA', '']).sum()
        print(f"{col}: {null_strings} NULL/NA strings")

CustomerID                  0
Gender                      0
Age                         5
Annual Income (k$)          1
 Spending Score (1-100)     0
Membership Type            19
Email                      21
Phone Number               22
dtype: int64
Gender: 0 NULL/NA strings
Membership Type: 0 NULL/NA strings
Email: 0 NULL/NA strings
Phone Number: 0 NULL/NA strings

# Step 4: Standardize Column Names
Convert column names into a uniform format (e.g., lowercase, replace spaces with underscores).This prevents confusion and maintains consistent naming conventions for analysis.

In [13]:
# Clean column names
df.columns = df.columns.str.lower()
df.columns = df.columns.str.replace(' ', '_')
df.columns = df.columns.str.replace('(', '').str.replace(')', '')
df.columns = df.columns.str.replace('$', '')

# Rename for clarity
df.rename(columns={
    'customerid': 'customer_id',
    'annual_income_k': 'annual_income'
}, inplace=True)

# Step 5: Clean Age Column
Convert age values to numeric and remove out-of-range or unrealistic values. Treat missing values and ensure the final age data makes logical sense.

In [14]:
# Replace NULL/NA strings with NaN
df['age'] = df['age'].replace(['NULL', 'NA', 'null', 'na', ''], np.nan)

# Convert to numeric
df['age'] = pd.to_numeric(df['age'], errors='coerce')

# Fix negative ages
print(f"Negative ages: {(df['age'] < 0).sum()}")
df.loc[df['age'] < 0, 'age'] = df.loc[df['age'] < 0, 'age'].abs()

# Handle extreme ages (>120)
print(f"Extreme ages: {(df['age'] > 120).sum()}")
df.loc[df['age'] > 120, 'age'] = np.nan

# OPTION A: Fill with median
median_age = df['age'].median()
df['age'].fillna(median_age, inplace=True)

# OPTION B: Fill with mean
# mean_age = df['age'].mean()
# df['age'].fillna(mean_age, inplace=True)

# OPTION C: Leave as NaN for manual review

Negative ages: 5
Extreme ages: 2

# Step 5: Clean Annual Income
Strip symbols (₹, $, commas) and convert income values to numeric. Fix missing values or extreme outliers to maintain valid income data.

In [15]:
# Replace NULL strings and convert to numeric
df['annual_income'] = df['annual_income'].replace(['NULL', 'NA', ''], np.nan)
df['annual_income'] = pd.to_numeric(df['annual_income'], errors='coerce')

# Check for missing values
print(f"Missing income: {df['annual_income'].isnull().sum()}")

# Optional: Fill missing values
# df['annual_income'].fillna(df['annual_income'].median(), inplace=True)

Missing income: 1

# Step 6: Standardize Gender
Correct inconsistent gender entries such as “M”, “male”, “FEMALE”, or missing values.Map all entries to a consistent set like Male, Female, or Other.

In [16]:
# Clean and standardize
df['gender'] = df['gender'].str.strip().str.title()
df['gender'] = df['gender'].replace({
    'M': 'Male',
    'F': 'Female',
    'male': 'Male',
    'female': 'Female'
})

print(df['gender'].value_counts())

gender
Female    111
Male       89
Name: count, dtype: int64

# Step 7: Clean Membership Type 
Standardize membership labels such as “gold”, “GOLD ”, or “ Silver”. Fix spelling mistakes, strip spaces, and ensure consistent category names.

In [17]:
# Handle missing values
df['membership_type'] = df['membership_type'].replace(['', ' ', 'NULL', 'NA'], np.nan)

# Fill with 'Unknown'
df['membership_type'].fillna('Unknown', inplace=True)

# Standardize
df['membership_type'] = df['membership_type'].str.strip().str.title()

print(df['membership_type'].value_counts())

membership_type
Gold       61
Silver     60
Bronze     60
Unknown    19
Name: count, dtype: int64

# Step 8: Clean Email Column
Standardize and validate email formats by converting to lowercase, removing invalid entries, and ensuring proper structure.

In [18]:
# Trim and replace empty strings
df['email'] = df['email'].str.strip()
df['email'] = df['email'].replace('', np.nan)

# Validate email format
import re
email_pattern = r'^[\w\.-]+@[\w\.-]+\.\w+$'
df['email_valid'] = df['email'].str.match(email_pattern, na=False)

print(f"Missing emails: {df['email'].isnull().sum()}")
print(f"Invalid email formats: {(~df['email_valid'] & df['email'].notna()).sum()}")

Missing emails: 21
Invalid email formats: 0

# Step 9: Clean Phone Number
Remove non-numeric characters and validate length. Format numbers consistently, and handle invalid or missing values.

In [19]:
# Trim and replace empty strings
df['phone_number'] = df['phone_number'].str.strip()
df['phone_number'] = df['phone_number'].replace('', np.nan)

print(f"Missing phone numbers: {df['phone_number'].isnull().sum()}")

# Optional: Standardize format
# df['phone_number'] = df['phone_number'].str.replace('-', '')

Missing phone numbers: 22

# Step 10: Check for Duplicates
Search for duplicate rows based on key fields or entire records. Remove duplicates to avoid repeated or biased information during analysis.

In [20]:
# Check complete duplicates
complete_dups = df.duplicated().sum()
print(f"Complete duplicates: {complete_dups}")

# Check customer_id duplicates
id_dups = df['customer_id'].duplicated().sum()
print(f"Duplicate IDs: {id_dups}")

# Check email duplicates
email_dups = df[df['email'].notna()]['email'].duplicated().sum()
print(f"Duplicate emails: {email_dups}")

# Remove duplicates
df = df.drop_duplicates(keep='first')

Complete duplicates: 0
Duplicate IDs: 0
Duplicate emails: 0

# Step 11: Validate Data Types
Confirm each column has appropriate data types like int, float, string, or datetime. Convert mismatched types to ensure proper computation and analysis.

In [22]:
# Convert to appropriate types
df['customer_id'] = df['customer_id'].astype(int)
df['age'] = pd.to_numeric(df['age'], errors='coerce')
df['annual_income'] = pd.to_numeric(df['annual_income'], errors='coerce')
df['gender'] = df['gender'].astype('string')
df['membership_type'] = df['membership_type'].astype('string')
df['email'] = df['email'].astype('string')
df['phone_number'] = df['phone_number'].astype('string')

print(df.dtypes)

customer_id                       int32
gender                   string[python]
age                             float64
annual_income                   float64
_spending_score_1-100             int64
membership_type          string[python]
email                    string[python]
phone_number             string[python]
email_valid                        bool
dtype: object

# Step 12: Final Quality Check
Review the dataset to ensure all cleaning tasks have been applied correctly.
Verify that values are consistent, valid, and ready for analysis.

In [23]:
# Create quality report
print("\n" + "="*60)
print("FINAL DATA QUALITY REPORT")
print("="*60)

print(f"\nDataset Shape: {df.shape}")
print(f"Total Records: {len(df)}")

print("\nMissing Values:")
missing_df = pd.DataFrame({
    'Column': df.columns,
    'Missing': df.isnull().sum().values,
    'Percentage': (df.isnull().sum() / len(df) * 100).round(2).values
})
print(missing_df)

print("\nSummary Statistics:")
print(df.describe())

============================================================
FINAL DATA QUALITY REPORT
============================================================

Dataset Shape: (200, 9)
Total Records: 200

Missing Values:
                  Column  Missing  Percentage
0            customer_id        0         0.0
1                 gender        0         0.0
2                    age        0         0.0
3          annual_income        1         0.5
4  _spending_score_1-100        0         0.0
5        membership_type        0         0.0
6                  email       21        10.5
7           phone_number       22        11.0
8            email_valid        0         0.0

Summary Statistics:
       customer_id         age  annual_income  _spending_score_1-100
count   200.000000  200.000000     199.000000             200.000000
mean    100.500000   43.575000      66.472362              52.185000
std      57.879185   11.179862      32.408192              35.090132
min       1.000000   19.000000      15.000000               3.000000
25%      50.750000   35.000000      38.500000              15.000000
50%     100.500000   44.000000      65.000000              35.500000
75%     150.250000   51.000000      91.500000              88.000000
max     200.000000   72.000000     140.000000              99.000000

# Step 13: Save Cleaned Data
Export the processed dataset to a clean format, such as CSV or Excel. This version is now ready for modeling, visualization, or further tasks.

In [24]:
# Save to CSV
df.to_csv('mall_customer_cleaned.csv', index=False)
print("\n✅ Cleaned data saved to 'mall_customer_cleaned.csv'")

# Save to Excel (optional)
# df.to_excel('mall_customer_cleaned.xlsx', index=False)

✅ Cleaned data saved to 'mall_customer_cleaned.csv'